kk_spot_api/app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_song
      @song = Song.find(params[:id])